# Terraform environment at22
#### Format and Style 🖌`success`
#### Initialization ⚙️`success`
#### Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Plan 📖`success`

<details><summary>Show Plan</summary>

```

[Lines containing Refreshing state removed]
[Truncated to 120000 bytes! See logoutput for complete plan]
Acquiring state lock. This may take a few moments...
module.key_vault.data.azurerm_private_dns_zone.key_vault: Reading...
module.rbac.data.azurerm_resource_group.spoke: Reading...
data.azurerm_user_assigned_identity.admin: Reading...
data.azurerm_subnet.postgres: Reading...
data.azurerm_subnet.default: Reading...
module.key_vault.data.azurerm_client_config.current: Reading...
module.postgres_server.data.azurerm_client_config.current: Reading...
data.azurerm_client_config.current: Reading...
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD03MjQ0YzE3OS1kZTg2LTRjMDYtYTY3YS0xMTQ3N2ExNGNhMzc7b2JqZWN0SWQ9NmVhZWQyM2UtZGY3Zi00NzA4LTljOGUtYTdmMzRkZWVhZGI0O3N1YnNjcmlwdGlvbklkPTM3YmFjNjNhLWI5NjQtNDZiMi04ZGU4LWJhOTNjNDMyZWExZjt0ZW5hbnRJZD1jZDAwMjZkOC0yODNiLTRhNTUtOWJmYS1kMGVmNGE4YmEyMWM=]
module.key_vault.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD03MjQ0YzE3OS1kZTg2LTRjMDYtYTY3YS0xMTQ3N2ExNGNhMzc7b2JqZWN0SWQ9NmVhZWQyM2UtZGY3Zi00NzA4LTljOGUtYTdmMzRkZWVhZGI0O3N1YnNjcmlwdGlvbklkPTM3YmFjNjNhLWI5NjQtNDZiMi04ZGU4LWJhOTNjNDMyZWExZjt0ZW5hbnRJZD1jZDAwMjZkOC0yODNiLTRhNTUtOWJmYS1kMGVmNGE4YmEyMWM=]
module.postgres_server.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD03MjQ0YzE3OS1kZTg2LTRjMDYtYTY3YS0xMTQ3N2ExNGNhMzc7b2JqZWN0SWQ9NmVhZWQyM2UtZGY3Zi00NzA4LTljOGUtYTdmMzRkZWVhZGI0O3N1YnNjcmlwdGlvbklkPTM3YmFjNjNhLWI5NjQtNDZiMi04ZGU4LWJhOTNjNDMyZWExZjt0ZW5hbnRJZD1jZDAwMjZkOC0yODNiLTRhNTUtOWJmYS1kMGVmNGE4YmEyMWM=]
module.rbac_platform_app["8fcf3019-ee5f-44d4-8c57-b2248f6f282e"].data.azurerm_resource_group.spoke: Reading...
module.rbac_platform_app["2b74d490-2e91-48ad-aee1-478276b7e4e4"].data.azurerm_resource_group.spoke: Reading...
module.key_vault.data.azurerm_log_analytics_workspace.log_dwh: Reading...
module.rbac_platform_app["2b74d490-2e91-48ad-aee1-478276b7e4e4"].data.azurerm_resource_group.spoke: Read complete after 0s [id=/subscriptions/37bac63a-b964-46b2-8de8-ba93c432ea1f/resourceGroups/rgaltinnauth001at22]
module.key_vault.data.azurerm_private_dns_zone.key_vault: Read complete after 0s [id=/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub/providers/Microsoft.Network/privateDnsZones/privatelink.vaultcore.azure.net]
data.azurerm_subnet.postgres: Read complete after 0s [id=/subscriptions/37bac63a-b964-46b2-8de8-ba93c432ea1f/resourceGroups/rgaltinnauth001at22/providers/Microsoft.Network/virtualNetworks/vnetssaltinnauth001at22/subnets/Postgres]
module.rbac_platform_app["8fcf3019-ee5f-44d4-8c57-b2248f6f282e"].data.azurerm_resource_group.spoke: Read complete after 0s [id=/subscriptions/37bac63a-b964-46b2-8de8-ba93c432ea1f/resourceGroups/rgaltinnauth001at22]
module.rbac_platform_app["2b74d490-2e91-48ad-aee1-478276b7e4e4"].data.azurerm_servicebus_namespace.use_masstransit[0]: Reading...
module.rbac_platform_app["8fcf3019-ee5f-44d4-8c57-b2248f6f282e"].data.azurerm_servicebus_namespace.use_masstransit[0]: Reading...
module.rbac_platform_app["8fcf3019-ee5f-44d4-8c57-b2248f6f282e"].data.azurerm_storage_account.use_lease[0]: Reading...
module.rbac_platform_app["2b74d490-2e91-48ad-aee1-478276b7e4e4"].data.azurerm_storage_account.use_lease[0]: Reading...
data.azurerm_subnet.default: Read complete after 0s [id=/subscriptions/37bac63a-b964-46b2-8de8-ba93c432ea1f/resourceGroups/rgaltinnauth001at22/providers/Microsoft.Network/virtualNetworks/vnetdsaltinnauth001at22/subnets/Default]
module.key_vault.data.azurerm_resource_group.key_vault: Reading...
module.rbac.data.azurerm_resource_group.spoke: Read complete after 0s [id=/subscriptions/37bac63a-b964-46b2-8de8-ba93c432ea1f/resourceGroups/rgaltinnauth001at22]
data.azurerm_user_assigned_identity.admin: Read complete after 0s [id=/subscriptions/37bac63a-b964-46b2-8de8-ba93c432ea1f/resourceGroups/rgaltinnauth001at22/providers/Microsoft.ManagedIdentity/userAssignedIdentities/mipgsqladminaltinnauth001at22]
module.rbac.data.azurerm_servicebus_namespace.use_masstransit[0]: Reading...
module.rbac_platform_app["2b74d490-2e91-48ad-aee1-478276b7e4e4"].data.azurerm_storage_account.use_lease[0]: Read complete after 1s [id=/subscriptions/37bac63a-b964-46b2-8de8-ba93c432ea1f/resourceGroups/rgaltinnauth001at22/providers/Microsoft.Storage/storageAccounts/staltinnauth001at22]
module.rbac.data.azurerm_storage_account.use_lease[0]: Reading...
module.key_vault.data.azurerm_log_analytics_workspace.log_dwh: Read complete after 1s [id=/subscriptions/37bac63a-b964-46b2-8de8-ba93c432ea1f/resourceGroups/rgaltinnauth001at22/providers/Microsoft.OperationalInsights/workspaces/logdwhaltinnauth001at22]
module.rbac_platform_app["8fcf3019-ee5f-44d4-8c57-b2248f6f282e"].data.azurerm_storage_account.use_lease[0]: Read complete after 1s [id=/subscriptions/37bac63a-b964-46b2-8de8-ba93c432ea1f/resourceGroups/rgaltinnauth001at22/providers/Microsoft.Storage/storageAccounts/staltinnauth001at22]
module.rbac_platform_app["8fcf3019-ee5f-44d4-8c57-b2248f6f282e"].data.azurerm_client_config.hub: Reading...
module.postgres_server.data.azurerm_virtual_network.hub: Reading...
module.rbac_platform_app["8fcf3019-ee5f-44d4-8c57-b2248f6f282e"].data.azurerm_client_config.hub: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD03MjQ0YzE3OS1kZTg2LTRjMDYtYTY3YS0xMTQ3N2ExNGNhMzc7b2JqZWN0SWQ9NmVhZWQyM2UtZGY3Zi00NzA4LTljOGUtYTdmMzRkZWVhZGI0O3N1YnNjcmlwdGlvbklkPTAxZGU0OWNiLTQ4ZWYtNDQ5NC1iYzlkLWI5ZTE5YTkwYmNkNTt0ZW5hbnRJZD1jZDAwMjZkOC0yODNiLTRhNTUtOWJmYS1kMGVmNGE4YmEyMWM=]
data.azurerm_private_dns_zone.postgres: Reading...
module.key_vault.data.azurerm_resource_group.key_vault: Read complete after 2s [id=/subscriptions/37bac63a-b964-46b2-8de8-ba93c432ea1f/resourceGroups/rgaltinnauthaccessmgmt001at22]
module.rbac_platform_app["2b74d490-2e91-48ad-aee1-478276b7e4e4"].data.azurerm_client_config.hub: Reading...
module.rbac_platform_app["2b74d490-2e91-48ad-aee1-478276b7e4e4"].data.azurerm_client_config.hub: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD03MjQ0YzE3OS1kZTg2LTRjMDYtYTY3YS0xMTQ3N2ExNGNhMzc7b2JqZWN0SWQ9NmVhZWQyM2UtZGY3Zi00NzA4LTljOGUtYTdmMzRkZWVhZGI0O3N1YnNjcmlwdGlvbklkPTAxZGU0OWNiLTQ4ZWYtNDQ5NC1iYzlkLWI5ZTE5YTkwYmNkNTt0ZW5hbnRJZD1jZDAwMjZkOC0yODNiLTRhNTUtOWJmYS1kMGVmNGE4YmEyMWM=]
module.rbac.data.azurerm_client_config.hub: Reading...
module.rbac.data.azurerm_client_config.hub: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD03MjQ0YzE3OS1kZTg2LTRjMDYtYTY3YS0xMTQ3N2ExNGNhMzc7b2JqZWN0SWQ9NmVhZWQyM2UtZGY3Zi00NzA4LTljOGUtYTdmMzRkZWVhZGI0O3N1YnNjcmlwdGlvbklkPTAxZGU0OWNiLTQ4ZWYtNDQ5NC1iYzlkLWI5ZTE5YTkwYmNkNTt0ZW5hbnRJZD1jZDAwMjZkOC0yODNiLTRhNTUtOWJmYS1kMGVmNGE4YmEyMWM=]
module.rbac.data.azurerm_resource_group.hub: Reading...
module.appsettings.data.azurerm_client_config.hub: Reading...
module.appsettings.data.azurerm_client_config.hub: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD03MjQ0YzE3OS1kZTg2LTRjMDYtYTY3YS0xMTQ3N2ExNGNhMzc7b2JqZWN0SWQ9NmVhZWQyM2UtZGY3Zi00NzA4LTljOGUtYTdmMzRkZWVhZGI0O3N1YnNjcmlwdGlvbklkPTAxZGU0OWNiLTQ4ZWYtNDQ5NC1iYzlkLWI5ZTE5YTkwYmNkNTt0ZW5hbnRJZD1jZDAwMjZkOC0yODNiLTRhNTUtOWJmYS1kMGVmNGE4YmEyMWM=]
module.appsettings.data.azurerm_resource_group.hub: Reading...
module.rbac_platform_app["8fcf3019-ee5f-44d4-8c57-b2248f6f282e"].data.azurerm_resource_group.hub: Reading...
module.rbac.data.azurerm_storage_account.use_lease[0]: Read complete after 1s [id=/subscriptions/37bac63a-b964-46b2-8de8-ba93c432ea1f/resourceGroups/rgaltinnauth001at22/providers/Microsoft.Storage/storageAccounts/staltinnauth001at22]
module.rbac_platform_app["2b74d490-2e91-48ad-aee1-478276b7e4e4"].data.azurerm_resource_group.hub: Reading...
data.azurerm_private_dns_zone.postgres: Read complete after 1s [id=/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub/providers/Microsoft.Network/privateDnsZones/privatelink.postgres.database.azure.com]
module.rbac.data.azurerm_resource_group.hub: Read complete after 0s [id=/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub]
module.rbac_platform_app["8fcf3019-ee5f-44d4-8c57-b2248f6f282e"].data.azurerm_resource_group.hub: Read complete after 0s [id=/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub]
module.rbac_platform_app["2b74d490-2e91-48ad-aee1-478276b7e4e4"].data.azurerm_resource_group.hub: Read complete after 0s [id=/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub]
module.postgres_server.data.azurerm_virtual_network.hub: Read complete after 1s [id=/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub/providers/Microsoft.Network/virtualNetworks/vnetaltinnauth001hub]
module.rbac_platform_app["2b74d490-2e91-48ad-aee1-478276b7e4e4"].data.azurerm_servicebus_namespace.use_masstransit[0]: Read complete after 2s [id=/subscriptions/37bac63a-b964-46b2-8de8-ba93c432ea1f/resourceGroups/rgaltinnauth001at22/providers/Microsoft.ServiceBus/namespaces/sbaltinnauth001at22]
module.appsettings.data.azurerm_resource_group.hub: Read complete after 0s [id=/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub]
module.rbac_platform_app["8fcf3019-ee5f-44d4-8c57-b2248f6f282e"].data.azurerm_servicebus_namespace.use_masstransit[0]: Read complete after 2s [id=/subscriptions/37bac63a-b964-46b2-8de8-ba93c432ea1f/resourceGroups/rgaltinnauth001at22/providers/Microsoft.ServiceBus/namespaces/sbaltinnauth001at22]
module.rbac.data.azurerm_servicebus_namespace.use_masstransit[0]: Read complete after 3s [id=/subscriptions/37bac63a-b964-46b2-8de8-ba93c432ea1f/resourceGroups/rgaltinnauth001at22/providers/Microsoft.ServiceBus/namespaces/sbaltinnauth001at22]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.azurerm_key_vault_secret.postgres_app will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_key_vault_secret" "postgres_app" {
      + content_type            = (known after apply)
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/37bac63a-b964-46b2-8de8-ba93c432ea1f/resourceGroups/rgaltinnauthaccessmgmt001at22/providers/Microsoft.KeyVault/vaults/kvacmaltinnauth001at22"
      + name                    = "db-psqlsrvaltinnauthaccessmgmt001at22-accessmgmt-app"
      + not_before_date         = (known after apply)
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = (known after apply)
      + value                   = (sensitive value)
      + versionless_id          = (known after apply)
    }

  # data.azurerm_key_vault_secret.postgres_migration will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_key_vault_secret" "postgres_migration" {
      + content_type            = (known after apply)
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/37bac63a-b964-46b2-8de8-ba93c432ea1f/resourceGroups/rgaltinnauthaccessmgmt001at22/providers/Microsoft.KeyVault/vaults/kvacmaltinnauth001at22"
      + name                    = "db-psqlsrvaltinnauthaccessmgmt001at22-accessmgmt-migrator"
      + not_before_date         = (known after apply)
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = (known after apply)
      + value                   = (sensitive value)
      + versionless_id          = (known after apply)
    }

  # null_resource.bootstrap_database must be replaced
-/+ resource "null_resource" "bootstrap_database" {
      ~ id       = "2336944609154912125" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "ts" = "2025-03-05T11:57:29Z" -> (known after apply)
        }
    }

  # module.appsettings.azurerm_app_configuration_key.key_vault_reference["Database:Postgres:AppConnectionString_at22-access-management"] will be updated in-place
  ~ resource "azurerm_app_configuration_key" "key_vault_reference" {
        id                     = "https://appconfaltinnauth001hub.azconfig.io/kv/Database:Postgres:AppConnectionString?label=at22-access-management"
        tags                   = {}
      ~ vault_key_reference    = "https://kvacmaltinnauth001at22.vault.azure.net/secrets/db-psqlsrvaltinnauthaccessmgmt001at22-accessmgmt-app" -> (known after apply)
        # (8 unchanged attributes hidden)
    }

  # module.appsettings.azurerm_app_configuration_key.key_vault_reference["Database:Postgres:MigrationConnectionString_at22-access-management"] will be updated in-place
  ~ resource "azurerm_app_configuration_key" "key_vault_reference" {
        id                     = "https://appconfaltinnauth001hub.azconfig.io/kv/Database:Postgres:MigrationConnectionString?label=at22-access-management"
        tags                   = {}
      ~ vault_key_reference    = "https://kvacmaltinnauth001at22.vault.azure.net/secrets/db-psqlsrvaltinnauthaccessmgmt001at22-accessmgmt-migrator" -> (known after apply)
        # (8 unchanged attributes hidden)
    }

  # module.key_vault.azurerm_private_endpoint.key_vault will be updated in-place
  ~ resource "azurerm_private_endpoint" "key_vault" {
        id                            = "/subscriptions/37bac63a-b964-46b2-8de8-ba93c432ea1f/resourceGroups/rgaltinnauthaccessmgmt001at22/providers/Microsoft.Network/privateEndpoints/pepkvacmaltinnauth001at22"
        name                          = "pepkvacmaltinnauth001at22"
        tags                          = {}
        # (7 unchanged attributes hidden)

      ~ private_dns_zone_group {
            id                   = "/subscriptions/37bac63a-b964-46b2-8de8-ba93c432ea1f/resourceGroups/rgaltinnauthaccessmgmt001at22/providers/Microsoft.Network/privateEndpoints/pepkvacmaltinnauth001at22/privateDnsZoneGroups/privatelink.vaultcore.azure.net"
            name                 = "privatelink.vaultcore.azure.net"
          ~ private_dns_zone_ids = [
              + "/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub/providers/Microsoft.Network/privateDnsZones/privatelink.vaultcore.azure.net",
            ]
        }

        # (1 unchanged block hidden)
    }

  # module.postgres_server.azurerm_management_lock.postgres must be replaced
-/+ resource "azurerm_management_lock" "postgres" {
      ~ id         = "/subscriptions/37bac63a-b964-46b2-8de8-ba93c432ea1f/resourceGroups/rgaltinnauthaccessmgmt001at22/providers/Microsoft.DBforPostgreSQL/flexibleServers/psqlsrvaltinnauthaccessmgmt001at22/providers/Microsoft.Authorization/locks/Terraform Managed Lock" -> (known after apply)
        name       = "Terraform Managed Lock"
      ~ notes      = "Prevents unauthorized user activity to delete postgres server" -> "Prevents unauthorized users from deleting the Postgres server." # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.postgres_server.azurerm_postgresql_flexible_server.postgres_server will be updated in-place
  ~ resource "azurerm_postgresql_flexible_server" "postgres_server" {
      ~ administrator_password            = (sensitive value)
        id                                = "/subscriptions/37bac63a-b964-46b2-8de8-ba93c432ea1f/resourceGroups/rgaltinnauthaccessmgmt001at22/providers/Microsoft.DBforPostgreSQL/flexibleServers/psqlsrvaltinnauthaccessmgmt001at22"
        name                              = "psqlsrvaltinnauthaccessmgmt001at22"
        tags                              = {}
        # (18 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.postgres_server.random_password.pass must be replaced
-/+ resource "random_password" "pass" {
      ~ bcrypt_hash      = (sensitive value)
      ~ id               = "none" -> (known after apply)
      ~ keepers          = { # forces replacement
          ~ "trigger" = "2025-03-05T11:54:27Z" -> (known after apply)
        }
      ~ result           = (sensitive value)
        # (11 unchanged attributes hidden)
    }

Plan: 3 to add, 4 to change, 3 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan.out

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan.out"
Releasing state lock. This may take a few moments...

```

</details>

| Context | Values |
| - | - |
| Pusher | @andreasisnes |
| Action | `push` |
| Working Directory | `src/apps/Altinn.AccessManagement/infra` |
| State File | `github.com/altinn/altinn-authorization-tmp/environments/at22/altinn.accessmanagement.tfstate` |
| Plan File | `github.com_altinn_altinn-authorization-tmp_environments_at22_altinn.accessmanagement.tfstate.tfplan`